public class Human implements ProcessDrive, ProcessFly {
    /*
    1. Створити клас людина і двох потомків. Водій та пілот.
    Створити інтерфейс для описання процесу водіння. Зробити так, щоб цей клас імплементував цей інтерфейс
    2. Створити інтерфейс який описує вміння літати і імплементувати його
    3. У головному класі викликати методи летати та водити авто за допомогою інтерфейсів і поліморфізму
     */
    @Override
    public void Drive() {

    }

    @Override
    public void Fly() {

    }
}
