package project;

public class TripPlan {
}
/*
Планувальник подорожей
Створіть планувальник подорожей за допомогою Spring Boot та Angular. Платформа повинна дозволяти користувачам шукати
місця призначення, переглядати рекомендації та маршрути подорожі та створювати та зберігати власні плани подорожей.
Додаток повинен також містити систему аутентифікації та авторизації користувачів та бути адаптивним та придатним для
використання на мобільних пристроях.
Тема : Планувальник подорожей
Вимоги до проекту :
зроблений на Spring та Hibernate
реєстрація і авторизація / свій особистий кабінет
Користувач має мати змогу створювати свій план подорожей / відмічати найкращі (фейворіти), переглядати рекомендації,
ділитися планом з іншими користувачами
Платформа має дозволяти користувачам шукати місця призначення
Додаток має бути адаптнивним (Optional)
 */